<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%2312%20DataFrame_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B3%80%EA%B2%BD%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

#중복된 항 제거

In [0]:
df = pd.DataFrame({'k1' : ["one"] * 3 + ["two"] * 4,
                   'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [3]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

*duplicated() - 중복된 항은 True, 중복이 아닌 항은 False*

In [4]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [5]:
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [0]:
df["v1"] = np.arange(7)

In [7]:
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [8]:
df.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [9]:
df.drop_duplicates(["k2"])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [10]:
df.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [0]:
df2 = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                   'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [15]:
df2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
meat_to_animal = {'bacon' : 'pig', 'pulled pork' : 'pig', 'pastrami' : 'cow', 'corned beef' : 'cow', 'honey ham' : 'pig', 'nova lox' : 'salmon'}

In [23]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [0]:
df2["anima"] = df2